{
  "id": "sparkle-lost-star-m",
  "title": "Sparkle and the Lost Star",
  "description": "A tiny star has fallen from the sky and needs your help to get home!",
  "preview": {
    "tagline": "Can you help a little lost star find its way back to the sky?",
    "themes": ["stars", "friendship", "sparkles", "gentle adventure"],
    "estimatedMinutes": 8,
    "previewImageUrl": "/images/scenes/sparkle-lost-star-m/prologue.png",
    "ageRating": {
      "minAge": 3,
      "maxAge": 5,
      "reason": "Gentle adventure with a friendly star - perfect for little ones",
      "intensity": ["gentle"]
    }
  },
  "prologue": {
    "prologueImageUrl": "/images/scenes/sparkle-lost-star-m/prologue.png",
    "worldIntro": "It is nighttime in the Moonflower Meadow. The flowers glow softly in the dark. Fireflies dance in the air. Everything is peaceful and pretty.\n\nBut look! Up in the sky, a tiny star wobbles... and wobbles... and - oh no! - it falls!\n\nThe little star tumbles down, down, down through the clouds and lands with a soft POOF in the meadow.",
    "characterIntros": [
      {
        "characterId": "star-friend",
        "introText": "Star Friend has a gentle heart and sparkly eyes! Magical creatures love to be his friend."
      }
    ],
    "missionBrief": "A kind hero sees the star fall. Maybe YOU can help the little star get back home to the sky?"
  },
  "characters": [
    {
      "id": "star-friend",
      "name": "Star Friend",
      "description": "A kind and gentle hero who can talk to magical creatures, wearing a space explorer suit with RED and SILVER accents",
      "imageUrl": "/images/characters/sparkle-lost-star-m/star-friend.png"
    }
  ],
  "scenes": [
    {
      "id": "scene-1",
      "sceneNumber": 0,
      "title": "Finding Twinkle",
      "narrationText": "You walk through the glowing meadow, looking for where the star landed. You hear a tiny sound... like someone crying very softly.\n\nBehind a big moonflower, you see a glow. You peek behind the flower and see a tiny, sad star with big sparkly eyes. It looks scared.\n\nThe little star needs a friend! Can you show it you're nice?",
      "sceneImageUrl": "/images/scenes/sparkle-lost-star-m/scene-1.png",
      "characterTurns": [
        {
          "characterId": "star-friend",
          "promptText": "Roll to show Twinkle you're friendly!",
          "choices": null,
          "alwaysSucceed": true,
          "outcome": {
            "text": "You smile your biggest, kindest smile. You whisper softly, 'Hello little star. Don't be scared!'\n\nThe tiny star peeks at you... its sparkles get brighter... and then it floats right up and snuggles against your cheek!\n\nIt feels warm and tingly! The little star LOVES you!",
            "cutsceneImageUrl": "/images/cutscenes/sparkle-lost-star-m/scene1-twinkle.png",
            "reward": {
              "id": "twinkle-friend",
              "name": "Twinkle the Star",
              "type": "friend",
              "imageUrl": "/images/rewards/sparkle-lost-star/twinkle-star.png"
            }
          }
        }
      ],
      "outcome": {
        "resultText": "The little star makes happy sparkle sounds. You decide to call it Twinkle!\n\nBut Twinkle looks up at the sky sadly. It wants to go home.\n\n'Don't worry, Twinkle,' you say. 'I'll help you get back to the sky!'",
        "nextSceneId": "scene-2"
      }
    },
    {
      "id": "scene-2",
      "sceneNumber": 1,
      "title": "The Cloud Staircase",
      "narrationText": "To get back to the sky, you need to climb the Cloud Staircase - fluffy cloud steps that go up, up, up!\n\nBut the first cloud is too high to reach. Twinkle is too little to fly that high.\n\nLook! Friendly fireflies are flying nearby. Maybe they can help!",
      "sceneImageUrl": "/images/scenes/sparkle-lost-star-m/scene-2.png",
      "characterTurns": [
        {
          "characterId": "star-friend",
          "promptText": "Roll to ask the fireflies for help!",
          "choices": null,
          "alwaysSucceed": true,
          "outcome": {
            "text": "You call out sweetly to the fireflies: 'Please help us reach the clouds!'\n\nThe fireflies gather together - ten, twenty, a HUNDRED of them! They swirl under your feet and lift you gently up, up, up!\n\nYou float through the soft fluffy clouds, higher and higher! Twinkle bounces with joy beside you!",
            "cutsceneImageUrl": "/images/cutscenes/sparkle-lost-star-m/scene2-fireflies.png"
          }
        }
      ],
      "outcome": {
        "resultText": "The fireflies carry you all the way up the Cloud Staircase! You wave thank you as they flutter back down.\n\nTwinkle glows happily beside you. Above, the stars are twinkling - they see their friend coming home!\n\nBut there's one more thing between you and the sky...",
        "nextSceneId": "scene-3"
      }
    },
    {
      "id": "scene-3",
      "sceneNumber": 2,
      "title": "The Moon Gate",
      "narrationText": "At the top of the Cloud Staircase is the Moon Gate - a beautiful archway made of moonbeams. This is the door to the sky where stars live!\n\nBut the gate is closed, and a gentle Moon Guardian sleeps in front of it. She looks very kind, with a dress made of moonlight.",
      "sceneImageUrl": "/images/scenes/sparkle-lost-star-m/scene-3.png",
      "characterTurns": [
        {
          "characterId": "star-friend",
          "promptText": "Roll to wake up the Moon Guardian nicely!",
          "choices": null,
          "alwaysSucceed": true,
          "outcome": {
            "text": "You tap the Moon Guardian's shoulder very softly.\n\nShe opens her silver eyes and smiles the warmest smile. 'Oh! A Star Friend! And you found little Twinkle!'\n\nShe looks so happy! 'Thank you for bringing our lost star home. You have the kindest heart.'",
            "cutsceneImageUrl": "/images/cutscenes/sparkle-lost-star-m/scene3-guardian.png"
          }
        }
      ],
      "outcome": {
        "resultText": "The Moon Guardian stands up tall. Her dress sparkles like a thousand stars.\n\n'You have been so kind to help Twinkle,' she says. 'Now it's time for Twinkle to go home to the sky.'\n\nShe looks at you with twinkling eyes. 'But first... would you like one last adventure together?'",
        "nextSceneId": "scene-4"
      }
    },
    {
      "id": "scene-4",
      "sceneNumber": 3,
      "title": "Flying to the Stars",
      "isClimax": true,
      "climaxMode": "solo-moment",
      "narrationText": "The Moon Guardian opens the Moon Gate. Beyond it, you can see the beautiful sky full of stars! They're all twinkling, waiting for Twinkle to come home.\n\nTwinkle looks at you with big sparkly eyes. It doesn't want to say goodbye!\n\nThe Moon Guardian smiles. 'Would you like to fly Twinkle home yourself?'\n\nTwinkle grows bigger - big enough to ride on!",
      "sceneImageUrl": "/images/scenes/sparkle-lost-star-m/scene-4.png",
      "characterTurns": [
        {
          "characterId": "star-friend",
          "promptText": "Roll to FLY to the stars!",
          "choices": null,
          "alwaysSucceed": true,
          "outcome": {
            "text": "You climb onto Twinkle's back. The little star is warm and glowy.\n\nYou hold on tight and - WHOOOOOOSH! - you're FLYING!\n\nThrough the Moon Gate, up through the clouds, higher and higher! The wind feels like giggles and all the stars are cheering for you!\n\nTwinkle spins and swirls, leaving a beautiful sparkle trail across the whole sky! WHEEEEE!",
            "cutsceneImageUrl": "/images/cutscenes/sparkle-lost-star-m/scene4-flying.png"
          }
        }
      ],
      "outcome": {
        "resultText": "You fly through the stars as they sing a twinkling song just for you.\n\nTwinkle finds its special spot in the sky and settles in - but keeps one sparkly arm wrapped around you for the ride back down."
      }
    }
  ],
  "ending": {
    "title": "Friends Forever",
    "narrationText": "Twinkle flies you gently back down to the Moonflower Meadow. The Moon Guardian is waiting with a smile.\n\n'You have the kindest heart,' she says. 'Twinkle will never forget you.'\n\nShe touches your chest and a tiny glow appears over your heart - a little star mark that sparkles!\n\n'Now whenever you look up at night, Twinkle will twinkle extra bright just for you. And if you ever need a friend...'\n\nYou look up at the sky. One little star is blinking and waving! Twinkle will always be your friend, even way up in the sky.\n\nYou wave goodbye and blow a kiss to your star friend. Twinkle catches it and glows even brighter!",
    "endingImageUrl": "/images/scenes/sparkle-lost-star-m/ending.png",
    "lootScreen": {
      "title": "You Did It!",
      "description": "You helped Twinkle get home! Look what you found!"
    },
    "rewards": [
      {
        "id": "star-heart",
        "name": "Star Heart Mark",
        "type": "magic",
        "imageUrl": "/images/rewards/sparkle-lost-star/star-heart.png"
      }
    ],
    "characterRewards": [
      {
        "characterId": "star-friend",
        "item": "Star Heart Mark",
        "description": "A magical mark that lets you talk to stars. Whenever you look up at night, Twinkle will twinkle extra bright just for you!",
        "imageUrl": "/images/rewards/sparkle-lost-star/star-heart.png"
      }
    ]
  }
}
